app/views/inicio/portada.html.haml

%h2 Últimas series añadidas
- @series = Series.order(created_at: :desc).limit(8)
---
SELECT "series".* FROM "series" ORDER BY "series"."created_at" DESC LIMIT 8

%h2 Últimas series seguidas
- @seguidas = FollowShow.order(created_at: :desc).limit(8)
- @seguidas.each do |seguida|
- series = Series.find(seguida.series_id)
---
SELECT "follow_shows".* FROM "follow_shows" ORDER BY "follow_shows"."created_at" DESC LIMIT 8
SELECT "series".* FROM "series" WHERE "series"."id" = ? LIMIT 1  [["id", 3]]