app/views/episodes/index.html.haml

SELECT "series".* FROM "series" WHERE "series"."id" = ? LIMIT 1  [["id", "3"]]
---
- @series = Series.find(params[:series_id])
.show
  .show-col-1

SELECT "episodes".* FROM "episodes" WHERE "episodes"."series_id" = ?  [["series_id", 3]]
---
            %table.tabla-episodios.table
              - @series.episodes.each do |episode|