app/views/links/index.html.haml

- @series = Series.find(params[:series_id])
- @episode = Episode.find(params[:episode_id])
.show
  .show-col-1
---
SELECT "series".* FROM "series" WHERE "series"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT 1  [["id", "1"]]

            %table.tabla-episodios.table
              -@episode.links.each do |elLink|
---
SELECT "links".* FROM "links" WHERE "links"."episode_id" = ?  [["episode_id", 1]]