app/controllers/episodes_controller.rb

  def create
		@series = Series.find(params[:series_id])
		parametros = params.require(:episode).permit(:nombre, :numero_temporada, :numero_episodio)
		puts parametros
		@episode = @series.episodes.create(parametros)
---
SELECT "series".* FROM "series" WHERE "series"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "episodes" ("created_at", "series_id", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 15 Nov 2013 22:26:48 UTC +00:00], ["series_id", 1], ["updated_at", Fri, 15 Nov 2013 22:26:48 UTC +00:00]]