app/controllers/follow_shows_controller.rb

	def create
		parametros = params.require(:follow_show).permit(:user_id, :series_id)
		puts "----------- LOS PARAMETROS SON: "
		puts parametros
		puts " ---------- FIN ---------------"
		@follow_show_anterior = FollowShow.where(parametros)
		if @follow_show_anterior.count == 0
			@follow_show = FollowShow.create(parametros)
		else
			@follow_show = FollowShow.find(@follow_show_anterior.first.id)
			@follow_show.destroy
---
INSERT INTO "follow_shows" ("created_at", "series_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 18 Nov 2013 18:16:51 UTC +00:00], ["series_id", 1], ["updated_at", Mon, 18 Nov 2013 18:16:51 UTC +00:00], ["user_id", 1]]
SELECT "follow_shows".* FROM "follow_shows" WHERE "follow_shows"."id" = ? LIMIT 1  [["id", 8]]
DELETE FROM "follow_shows" WHERE "follow_shows"."id" = ?  [["id", 8]]