app/controllers/links_controller.rb

  def create

		parametros = params.require(:link).permit(:enlace, :idioma, :subtitulos)
		puts "----------- LOS PARAMETROS SON: "
		puts parametros
		puts " ---------- FIN ---------------"
		puts "el parametro episode_id = "
		puts params[:episode_id]
		@episode = Episode.find(params[:episode_id])
		puts ".... metodos son ... "
		puts @episode.methods
		@link = @episode.links.create(parametros)
---
SELECT "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "links" ("created_at", "enlace", "episode_id", "idioma", "subtitulos", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sun, 17 Nov 2013 22:49:15 UTC +00:00], ["enlace", "aaa"], ["episode_id", 1], ["idioma", "sss"], ["subtitulos", "ddd"], ["updated_at", Sun, 17 Nov 2013 22:49:15 UTC +00:00]]