app/controllers/series_controller.rb

  def index
    @series = Series.all
---
SELECT "series".* FROM "series"

  def create
    @series = Series.new(series_params)

    respond_to do |format|
      if @series.save
---
INSERT INTO "series" ("created_at", "directores", "enlace_imagen", "generos", "imagen", "informacion", "nombre", "puntuacion", "sinopsis", "titulo_original", "updated_at", "votos") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @series.update(series_params)
---
UPDATE "series" SET "puntuacion" = ?, "generos" = ?, "updated_at" = ? WHERE "series"."id" = 1  [["puntuacion", #<BigDecimal:b5d82d08,'0.88E1',18(18)>], ["generos", "Drama, Misterio, Novela de Suspense"], ["updated_at", Mon, 18 Nov 2013 19:22:19 UTC +00:00]]

    def set_series
      @series = Series.find(params[:id])
---
SELECT "series".* FROM "series" WHERE "series"."id" = ? LIMIT 1  [["id", "1"]]