app/views/series/show.html.haml

            %table.tabla-episodios
              - @series.episodes.each do |episode|
---
SELECT "episodes".* FROM "episodes" WHERE "episodes"."series_id" = ?  [["series_id", 1]]